{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "ragged": false, "name": "movie_id"}, "name": "movie_id", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "ragged": false, "name": "user_id"}, "name": "user_id", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "ragged": false, "name": "gender"}, "name": "gender", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "ragged": false, "name": "age"}, "name": "age", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "ragged": false, "name": "occupation"}, "name": "occupation", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "ragged": false, "name": "zip"}, "name": "zip", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "sparse_emb_movie_id", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 187, "output_dim": 4, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.0001, "seed": 2020, "dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "sparse_emb_movie_id", "inbound_nodes": [[["movie_id", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "sparse_emb_user_id", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 193, "output_dim": 4, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.0001, "seed": 2020, "dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "sparse_emb_user_id", "inbound_nodes": [[["user_id", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "sparse_emb_gender", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 4, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.0001, "seed": 2020, "dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "sparse_emb_gender", "inbound_nodes": [[["gender", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "sparse_emb_age", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 7, "output_dim": 4, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.0001, "seed": 2020, "dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "sparse_emb_age", "inbound_nodes": [[["age", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "sparse_emb_occupation", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 20, "output_dim": 4, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.0001, "seed": 2020, "dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "sparse_emb_occupation", "inbound_nodes": [[["occupation", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "sparse_emb_zip", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 188, "output_dim": 4, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.0001, "seed": 2020, "dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "sparse_emb_zip", "inbound_nodes": [[["zip", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "linear0sparse_emb_movie_id", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 187, "output_dim": 1, "embeddings_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "linear0sparse_emb_movie_id", "inbound_nodes": [[["movie_id", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "linear0sparse_emb_user_id", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 193, "output_dim": 1, "embeddings_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "linear0sparse_emb_user_id", "inbound_nodes": [[["user_id", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "linear0sparse_emb_gender", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 1, "embeddings_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "linear0sparse_emb_gender", "inbound_nodes": [[["gender", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "linear0sparse_emb_age", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 7, "output_dim": 1, "embeddings_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "linear0sparse_emb_age", "inbound_nodes": [[["age", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "linear0sparse_emb_occupation", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 20, "output_dim": 1, "embeddings_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "linear0sparse_emb_occupation", "inbound_nodes": [[["occupation", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "linear0sparse_emb_zip", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 188, "output_dim": 1, "embeddings_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "embeddings_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "linear0sparse_emb_zip", "inbound_nodes": [[["zip", 0, 0, {}]]]}, {"class_name": "NoMask", "config": {"name": "no_mask_3", "trainable": true, "dtype": "float32"}, "name": "no_mask_3", "inbound_nodes": [[["sparse_emb_movie_id", 0, 0, {}]], [["sparse_emb_user_id", 0, 0, {}]], [["sparse_emb_gender", 0, 0, {}]], [["sparse_emb_age", 0, 0, {}]], [["sparse_emb_occupation", 0, 0, {}]], [["sparse_emb_zip", 0, 0, {}]]]}, {"class_name": "NoMask", "config": {"name": "no_mask", "trainable": true, "dtype": "float32"}, "name": "no_mask", "inbound_nodes": [[["linear0sparse_emb_movie_id", 0, 0, {}]], [["linear0sparse_emb_user_id", 0, 0, {}]], [["linear0sparse_emb_gender", 0, 0, {}]], [["linear0sparse_emb_age", 0, 0, {}]], [["linear0sparse_emb_occupation", 0, 0, {}]], [["linear0sparse_emb_zip", 0, 0, {}]]]}, {"class_name": "NoMask", "config": {"name": "no_mask_2", "trainable": true, "dtype": "float32"}, "name": "no_mask_2", "inbound_nodes": [[["sparse_emb_movie_id", 0, 0, {}]], [["sparse_emb_user_id", 0, 0, {}]], [["sparse_emb_gender", 0, 0, {}]], [["sparse_emb_age", 0, 0, {}]], [["sparse_emb_occupation", 0, 0, {}]], [["sparse_emb_zip", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["no_mask_3", 0, 0, {}], ["no_mask_3", 1, 0, {}], ["no_mask_3", 2, 0, {}], ["no_mask_3", 3, 0, {}], ["no_mask_3", 4, 0, {}], ["no_mask_3", 5, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["no_mask", 0, 0, {}], ["no_mask", 1, 0, {}], ["no_mask", 2, 0, {}], ["no_mask", 3, 0, {}], ["no_mask", 4, 0, {}], ["no_mask", 5, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_1", "inbound_nodes": [[["no_mask_2", 0, 0, {}], ["no_mask_2", 1, 0, {}], ["no_mask_2", 2, 0, {}], ["no_mask_2", 3, 0, {}], ["no_mask_2", 4, 0, {}], ["no_mask_2", 5, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Linear", "config": {"name": "linear", "trainable": true, "dtype": "float32", "mode": 0, "l2_reg": 1e-05, "use_bias": false, "seed": 1024}, "name": "linear", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "FM", "config": {"name": "fm", "trainable": true, "dtype": "float32"}, "name": "fm", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "DNN", "config": {"name": "dnn", "trainable": true, "dtype": "float32", "activation": "relu", "hidden_units": [256, 128, 64], "l2_reg": 0, "use_bn": false, "dropout_rate": 0, "output_activation": null, "seed": 1024}, "name": "dnn", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "NoMask", "config": {"name": "no_mask_1", "trainable": true, "dtype": "float32"}, "name": "no_mask_1", "inbound_nodes": [[["linear", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["fm", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": 1024}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["dnn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["no_mask_1", 0, 0, {}], ["add", 0, 0, {}], ["dense", 0, 0, {}]]]}, {"class_name": "PredictionLayer", "config": {"name": "prediction_layer", "trainable": true, "dtype": "float32", "task": "regression", "use_bias": true}, "name": "prediction_layer", "inbound_nodes": [[["add_1", 0, 0, {}]]]}], "input_layers": [["movie_id", 0, 0], ["user_id", 0, 0], ["gender", 0, 0], ["age", 0, 0], ["occupation", 0, 0], ["zip", 0, 0]], "output_layers": [["prediction_layer", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}