{"class_name": "Model", "config": {"name": "model_7", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "age_fea"}, "name": "age_fea", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "mlsfc_fea"}, "name": "mlsfc_fea", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "mcate_fea"}, "name": "mcate_fea", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "sex_fea"}, "name": "sex_fea", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "month_fea"}, "name": "month_fea", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "time_fea"}, "name": "time_fea", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "day_fea"}, "name": "day_fea", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "fav_plc_fea"}, "name": "fav_plc_fea", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "num_dense_2d_age", "trainable": true, "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "num_dense_2d_age", "inbound_nodes": [[["age_fea", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_15", "trainable": true, "dtype": "float32", "target_shape": [1, 30]}, "name": "reshape_15", "inbound_nodes": [[["num_dense_2d_age", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_2d_mlsfc", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 30, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_2d_mlsfc", "inbound_nodes": [[["mlsfc_fea", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_2d_mcate", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 138, "output_dim": 30, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_2d_mcate", "inbound_nodes": [[["mcate_fea", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_2d_month", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 13, "output_dim": 30, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_2d_month", "inbound_nodes": [[["sex_fea", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_2d_sex", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 30, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_2d_sex", "inbound_nodes": [[["month_fea", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_2d_time", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 25, "output_dim": 30, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_2d_time", "inbound_nodes": [[["time_fea", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_2d_day", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 8, "output_dim": 30, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_2d_day", "inbound_nodes": [[["day_fea", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_2d_fav_plc", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 137, "output_dim": 30, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_2d_fav_plc", "inbound_nodes": [[["fav_plc_fea", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concat_embed_2d", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concat_embed_2d", "inbound_nodes": [[["reshape_15", 0, 0, {}], ["cat_embed_2d_mlsfc", 0, 0, {}], ["cat_embed_2d_mcate", 0, 0, {}], ["cat_embed_2d_month", 0, 0, {}], ["cat_embed_2d_sex", 0, 0, {}], ["cat_embed_2d_time", 0, 0, {}], ["cat_embed_2d_day", 0, 0, {}], ["cat_embed_2d_fav_plc", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "sum_of_tensors", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAUwAAAHMOAAAAdABqAXwAZAFkAo0CUwApA07pAQAAACkB2gRh\neGlzKQLaAUvaA3N1bakB2gF4qQByBwAAAPoePGlweXRob24taW5wdXQtMi03MmFiYTMwYWJhZjM+\n2gg8bGFtYmRhPkYAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "sum_of_tensors", "inbound_nodes": [[["concat_embed_2d", 0, 0, {}]], [["square_of_tensors", 0, 0, {}]], [["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "square_of_tensors", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAADAAAAUwAAAHMKAAAAdACgAXwAoQFTACkBTikC2gFL2gZzcXVhcmWp\nAdoBeKkAcgUAAAD6HjxpcHl0aG9uLWlucHV0LTItNzJhYmEzMGFiYWYzPtoIPGxhbWJkYT5HAAAA\n8wAAAAA=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "square_of_tensors", "inbound_nodes": [[["concat_embed_2d", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flat_embed_2d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flat_embed_2d", "inbound_nodes": [[["concat_embed_2d", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "name": "multiply_1", "inbound_nodes": [[["sum_of_tensors", 0, 0, {}], ["sum_of_tensors", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["flat_embed_2d", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_1", "trainable": true, "dtype": "float32"}, "name": "subtract_1", "inbound_nodes": [[["multiply_1", 0, 0, {}], ["sum_of_tensors", 1, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_1d_mlsfc", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_1d_mlsfc", "inbound_nodes": [[["mlsfc_fea", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_1d_mcate", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 138, "output_dim": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_1d_mcate", "inbound_nodes": [[["mcate_fea", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_1d_month", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 13, "output_dim": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_1d_month", "inbound_nodes": [[["sex_fea", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_1d_sex", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_1d_sex", "inbound_nodes": [[["month_fea", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_1d_time", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 25, "output_dim": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_1d_time", "inbound_nodes": [[["time_fea", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_1d_day", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 8, "output_dim": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_1d_day", "inbound_nodes": [[["day_fea", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_1d_fav_plc", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 137, "output_dim": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_1d_fav_plc", "inbound_nodes": [[["fav_plc_fea", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAACAAAAUwAAAHMIAAAAfABkARQAUwApAk7nAAAAAAAA4D+pAKkB2gF4\ncgIAAAByAgAAAPoePGlweXRob24taW5wdXQtMi03MmFiYTMwYWJhZjM+2gg8bGFtYmRhPlAAAADz\nAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["subtract_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "num_dense_1d_age", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "num_dense_1d_age", "inbound_nodes": [[["age_fea", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_8", "trainable": true, "dtype": "float32", "target_shape": [1]}, "name": "reshape_8", "inbound_nodes": [[["cat_embed_1d_mlsfc", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_9", "trainable": true, "dtype": "float32", "target_shape": [1]}, "name": "reshape_9", "inbound_nodes": [[["cat_embed_1d_mcate", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_10", "trainable": true, "dtype": "float32", "target_shape": [1]}, "name": "reshape_10", "inbound_nodes": [[["cat_embed_1d_month", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_11", "trainable": true, "dtype": "float32", "target_shape": [1]}, "name": "reshape_11", "inbound_nodes": [[["cat_embed_1d_sex", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_12", "trainable": true, "dtype": "float32", "target_shape": [1]}, "name": "reshape_12", "inbound_nodes": [[["cat_embed_1d_time", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_13", "trainable": true, "dtype": "float32", "target_shape": [1]}, "name": "reshape_13", "inbound_nodes": [[["cat_embed_1d_day", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_14", "trainable": true, "dtype": "float32", "target_shape": [1]}, "name": "reshape_14", "inbound_nodes": [[["cat_embed_1d_fav_plc", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "fm_1d_output", "trainable": true, "dtype": "float32"}, "name": "fm_1d_output", "inbound_nodes": [[["num_dense_1d_age", 0, 0, {}], ["reshape_8", 0, 0, {}], ["reshape_9", 0, 0, {}], ["reshape_10", 0, 0, {}], ["reshape_11", 0, 0, {}], ["reshape_12", 0, 0, {}], ["reshape_13", 0, 0, {}], ["reshape_14", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "fm_2d_output", "trainable": true, "dtype": "float32", "target_shape": [1]}, "name": "fm_2d_output", "inbound_nodes": [[["sum_of_tensors", 2, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "deep_output", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "deep_output", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["fm_1d_output", 0, 0, {}], ["fm_2d_output", 0, 0, {}], ["deep_output", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "deepfm_output", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "deepfm_output", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}], "input_layers": [["age_fea", 0, 0], ["mlsfc_fea", 0, 0], ["mcate_fea", 0, 0], ["sex_fea", 0, 0], ["month_fea", 0, 0], ["time_fea", 0, 0], ["day_fea", 0, 0], ["fav_plc_fea", 0, 0]], "output_layers": [["deepfm_output", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}