{"class_name": "Model", "config": {"name": "model_7", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_fea3"}, "name": "input_fea3", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_genre"}, "name": "input_genre", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_uid"}, "name": "input_uid", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_mid"}, "name": "input_mid", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "num_dense_2d_fea3", "trainable": true, "dtype": "float32", "units": 20, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "num_dense_2d_fea3", "inbound_nodes": [[["input_fea3", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_2d_genre", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 15, "output_dim": 20, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_2d_genre", "inbound_nodes": [[["input_genre", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_7", "trainable": true, "dtype": "float32", "target_shape": [1, 20]}, "name": "reshape_7", "inbound_nodes": [[["num_dense_2d_fea3", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_2d_uid", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 6041, "output_dim": 20, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_2d_uid", "inbound_nodes": [[["input_uid", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_2d_mid", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3953, "output_dim": 20, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_2d_mid", "inbound_nodes": [[["input_mid", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "cat_embed_2d_genure_mean", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMQAAAAdABqAXwAZAGIAGQCjQNTACkDTukBAAAAKQLa\nBGF4aXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkBcgMAAACpAPoePGlweXRob24taW5wdXQt\nMi04ZWYzMjI1N2U2MTU+2gg8bGFtYmRhPhoAAADzAAAAAA==\n", null, [true]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "cat_embed_2d_genure_mean", "inbound_nodes": [[["cat_embed_2d_genre", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concat_embed_2d", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concat_embed_2d", "inbound_nodes": [[["reshape_7", 0, 0, {}], ["cat_embed_2d_uid", 0, 0, {}], ["cat_embed_2d_mid", 0, 0, {}], ["cat_embed_2d_genure_mean", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "sum_of_tensors", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAUwAAAHMOAAAAdABqAXwAZAFkAo0CUwApA07pAQAAACkB2gRh\neGlzKQLaAUvaA3N1bakB2gF4qQByBwAAAPoePGlweXRob24taW5wdXQtMi04ZWYzMjI1N2U2MTU+\n2gg8bGFtYmRhPkIAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "sum_of_tensors", "inbound_nodes": [[["concat_embed_2d", 0, 0, {}]], [["square_of_tensors", 0, 0, {}]], [["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "square_of_tensors", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAADAAAAUwAAAHMKAAAAdACgAXwAoQFTACkBTikC2gFL2gZzcXVhcmWp\nAdoBeKkAcgUAAAD6HjxpcHl0aG9uLWlucHV0LTItOGVmMzIyNTdlNjE1PtoIPGxhbWJkYT5DAAAA\n8wAAAAA=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "square_of_tensors", "inbound_nodes": [[["concat_embed_2d", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flat_embed_2d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flat_embed_2d", "inbound_nodes": [[["concat_embed_2d", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "name": "multiply_1", "inbound_nodes": [[["sum_of_tensors", 0, 0, {}], ["sum_of_tensors", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["flat_embed_2d", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_1", "trainable": true, "dtype": "float32"}, "name": "subtract_1", "inbound_nodes": [[["multiply_1", 0, 0, {}], ["sum_of_tensors", 1, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_1d_uid", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 6041, "output_dim": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_1d_uid", "inbound_nodes": [[["input_uid", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_1d_mid", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3953, "output_dim": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "cat_embed_1d_mid", "inbound_nodes": [[["input_mid", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "cat_embed_1d_genre", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 15, "output_dim": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "cat_embed_1d_genre", "inbound_nodes": [[["input_genre", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAACAAAAUwAAAHMIAAAAfABkARQAUwApAk7nAAAAAAAA4D+pAKkB2gF4\ncgIAAAByAgAAAPoePGlweXRob24taW5wdXQtMi04ZWYzMjI1N2U2MTU+2gg8bGFtYmRhPkwAAADz\nAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["subtract_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "num_dense_1d_fea4", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "num_dense_1d_fea4", "inbound_nodes": [[["input_fea3", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true, "dtype": "float32", "target_shape": [1]}, "name": "reshape_4", "inbound_nodes": [[["cat_embed_1d_uid", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_5", "trainable": true, "dtype": "float32", "target_shape": [1]}, "name": "reshape_5", "inbound_nodes": [[["cat_embed_1d_mid", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_6", "trainable": true, "dtype": "float32", "target_shape": [1]}, "name": "reshape_6", "inbound_nodes": [[["cat_embed_1d_genre", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "fm_1d_output", "trainable": true, "dtype": "float32"}, "name": "fm_1d_output", "inbound_nodes": [[["num_dense_1d_fea4", 0, 0, {}], ["reshape_4", 0, 0, {}], ["reshape_5", 0, 0, {}], ["reshape_6", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "fm_2d_output", "trainable": true, "dtype": "float32", "target_shape": [1]}, "name": "fm_2d_output", "inbound_nodes": [[["sum_of_tensors", 2, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "deep_output", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "deep_output", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["fm_1d_output", 0, 0, {}], ["fm_2d_output", 0, 0, {}], ["deep_output", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "deepfm_output", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "deepfm_output", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}], "input_layers": [["input_fea3", 0, 0], ["input_uid", 0, 0], ["input_mid", 0, 0], ["input_genre", 0, 0]], "output_layers": [["deepfm_output", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}